---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Fascia.FasciaType
source: html/cb6d7473-3192-49bf-a2ef-4ca4618a8219.htm
---
# Autodesk.Revit.DB.Architecture.Fascia.FasciaType Property

Retrieves/set an object that represents the type of the Fascia.

## Syntax (C#)
```csharp
public FasciaType FasciaType { get; set; }
```